#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
    system("mode con cols=40 lines=10");
    system("color 8E");
    int a{};
    int b{};
    int c{};

    cout << "年龄:";
    cin >> a;
    cout << "成绩:";
    cin >> b;

    //（1）年龄小于18岁，成绩大于等于90分
    //（2）年龄大于等于18岁，成绩小于等于90分

    //小于  18  且  大于等于  90  为 1 执行
    //或者  
    //大于等于  18  且  小于  90  为 1 执行

    if (((a < 18) && (b >= 90)) || ((a >= 18) && (b < 90)))
    {
        cout << "1";
    }
    else
        cout << "2";
    return 0;
}
//      &&(与) 当两个条件满足时，为 1  执行
//      ||(或) 当满足其中一个条件时，为 1  执行
//      ！(非) 当不满足条件时 为 1 执行

// && 逻辑与    || 逻辑或   ！逻辑非

//  1) 与运算(&&)
//参与运算的两个表达式都为真时，结果才为真，否则为假。例如：
// 5 && 0
// 5为真，0为假，相与的结果为假，也就是 0。

//(5>0) && (4>2)
// 5>0 的结果是1，为真，4>2结果是1，也为真，所以相与的结果为真，也就是1。

//  2) 或运算(||)
//参与运算的两个表达式只要有一个为真，结果就为真；两个表达式都为假时结果才为假。例如：
// 10 || 0
// 10为真，0为假，相或的结果为真，也就是 1。
//(5>0) || (5>8)
// 5>0 的结果是1，为真，5>8 的结果是0，为假，所以相或的结果为真，也就是1。

// 3) 非运算(!)
//参与运算的表达式为真时，结果为假；参与运算的表达式为假时，结果为真。例如：
//! 0
// 0 为假，非运算的结果为真，也就是 1。
//!(5>0)
// 5>0 的结果是1，为真，非运算的结果为假，也就是 0。

//优先级
//逻辑运算符和其它运算符优先级从低到高依次为：
//赋值运算符(=) < &&和|| < 关系运算符 < 算术运算符 < 非(!)
//&& 和 || 低于关系运算符，! 高于算术运算符。

/*

















*/