#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
    // 10000元 100套  高级桌子500  普通桌子300   椅子100三张
    int a{0}, b{0}, c{0};

    for (a = 0; a <= 100; a++)
    {
        for (b = 0; b <= 100; b++)
        {
            for (c = 0; c <= 100; c++)
            {
                if ((a + b + c == 100) && (a * 500 + b * 300 + c * 100 / 3 == 10000))
                    cout << "高级桌子采购" << a << "张，普通桌子采购" << b << "张，椅子采购" << c << "把" << endl;
            }
        }
    }

    a = 10000 / 500;
    b = 10000 / 300;
    for (int d = 0; d <= a; d++)
    {
        for (int e = 0; e <= b; e++)
        {
            int f = 100 - d - e;
            if (f % 3 != 0)
            {
                continue;
            }
            if (d * 500 + e * 300 + f * 100 / 3 == 10000)
            {
                cout << "高级桌子采购" << d << "张，普通桌子采购" << e << "张，椅子采购" << f << "把" << endl;
            }
        }
    }

    for (a = 0; a <= 3; a++)
    {
        cout << "高级桌子采购" << a * 4 << "张，普通桌子采购" << 25 - a * 7 << "张，椅子采购" << 75 + 3 * a << "把" << endl;
    }
}

/*
高级桌子采购0张，普通桌子采购25张，椅子采购75把
高级桌子采购4张，普通桌子采购18张，椅子采购78把
高级桌子采购8张，普通桌子采购11张，椅子采购81把
高级桌子采购12张，普通桌子采购4张，椅子采购84把
*/