#include <iostream>
using namespace std;

int main()
{
    int a{18}, b{80};
    /*     cin >> a;
        cin >> b; */
    ////异或 ^^^  相同为 0 不同 为 1
    ////     100110010
    ////     011101000
    ////     111011010
    ////     相同为 0 不同 为 1
    ////a=17 b=91
    ////条件是 小于18大于90  小于90  大于等于18
    ////a小于18 成立  b小于90  不成立  0 和 1 = 1
    ////
    ////
    ////
    int c = 154 ^ 235;
    cout << c << endl;
    if (((a < 18) && (a > 90)) || ((a >= 18) && (a < 90)))
    {
        if ((a < 18) ^ (b < 90))
        //// if的判断只有 0 和 1  如果遇到多条件运算，尽量使用 异或
        //// 如果 小于 18 成立 b 小于90 成立 1 1 = 0
        //// 用于 多条件的运算
        {
            cout << "1";
        }
        else
            cout << "2";
    }
}
